<h1 style="text-align: center", ;"> <font color=#FFFFF size=5> Tratamento e Manipulação de Dados - Desafios </font> </h1>

In [1]:
import pandas as pd
import numpy as np

In [2]:
# Projeto 1: Vendas Online
dados_vendas = pd.read_json('./data/dados_vendas_clientes.json')
dados_vendas = pd.json_normalize(dados_vendas['dados_vendas'])

# Projeto 2: Locação Imovéis
dados_imoveis = pd.read_json('./data/dados_locacao_imoveis.json')
dados_imoveis = pd.json_normalize(dados_imoveis['dados_locacao'])

In [3]:
dados_vendas

,Data de venda,Cliente,Valor da compra
0,06/06/2022,"[@ANA _LUCIA 321, DieGO ARMANDIU 210, DieGO AR...","[R$ 836,5, R$ 573,33, R$ 392,8, R$ 512,34]"
1,07/06/2022,"[Isabely JOanes 738, Isabely JOanes 738, Isabe...","[R$ 825,31, R$ 168,07, R$ 339,18, R$ 314,69]"
2,08/06/2022,"[Isabely JOanes 738, JOãO Gabriel 671, Julya m...","[R$ 682,05, R$ 386,34, R$ 622,65, R$ 630,79]"
3,09/06/2022,"[Julya meireles 914, MaRIA Julia 444, MaRIA Ju...","[R$ 390,3, R$ 759,16, R$ 334,47, R$ 678,78]"
4,10/06/2022,"[MaRIA Julia 444, PEDRO PASCO 812, Paulo castr...","[R$ 314,24, R$ 311,15, R$ 899,16, R$ 885,24]"

In [4]:
# Remover os dados em listas
dados_vendas = dados_vendas.explode(column=['Cliente', 'Valor da compra']).reset_index(drop=True)
dados_imoveis = dados_imoveis.explode(column=list(dados_imoveis.columns[1:])).reset_index(drop=True)

In [5]:
dados_vendas['Valor da compra'] = dados_vendas['Valor da compra'].apply(
    lambda x : x.replace('R$', '').replace(',', '.').strip()
)   
dados_imoveis['valor_aluguel'] = dados_imoveis['valor_aluguel'].str.replace('$ ', '').str.replace(',', '.').str.replace(' reais', '').str.strip()

In [6]:
dados_vendas['Valor da compra'] = dados_vendas['Valor da compra'].astype(np.float64)
dados_imoveis['valor_aluguel'] = dados_imoveis['valor_aluguel'].astype(np.float64)

In [7]:
dados_vendas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Data de venda    20 non-null     object
 1   Cliente          20 non-null     object
 2   Valor da compra  20 non-null     float64
dtypes: float64(1), object(2)
memory usage: 612.0+ bytes

In [8]:
dados_imoveis.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 4 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   apartamento                 30 non-null     object
 1   datas_combinadas_pagamento  30 non-null     object
 2   datas_de_pagamento          30 non-null     object
 3   valor_aluguel               30 non-null     float64
dtypes: float64(1), object(3)
memory usage: 1.1+ KB